
# -*- mode: org; -*-

#+TITLE:      PROJECT T, or APERTIUM++!
#+AUTHOR:      
#+DATE:        
#+EMAIL:       
#+LANGUAGE:    en
#+OPTIONS:     H:5 num:5 toc:t \n:nil ::t |:t ^:t f:t tex:t ...
#+BIBLIOGRAPHY: refs plain

This page documents research carried over in the [[https://taruen.github.io/apertiumpp/][Apertiumpp project]].

**** OPTIONS

- pivoting
  - translating entries from a public domain/libre English dictionary
    - Wordnet? GNU collaborative dictionary of English? Wiktionary?
      OmegaWiki?
  - same for Russian (if there is any available...)
    - TODO check [https://en.wikipedia.org/wiki/Ushakov_Dictionary] might be in
      the public domain now
  - translating entries from a libre Turkic dictionary
    - is there any? Probably not.
      - DONE email publishers ([[http://www.twirpx.com/file/1077154][this]] one is of interest).
        - Ibragimov Institute of Language, Literature and Art @ Tatarstan
          Academy of Sciences in email communication allowed entry words and
          part-of-speech tags from the currently 3-volume (А-К) ``Татар теленең
          аңлатмалы сүзлеге'' (``Explanatory Dictionary of Tatar'') found here
          http://www.antat.ru/tt/iyli/publishing/book/index.php to be used in
          Apertium's dictionaries.
    - even if there is one, allowing a monolingual Turkic speaker to translate
      words into his own language will require translating the *definitions* into
      English or Russian, which is a huge amount of work compared to translating
      the words only

- inducing from bilingual corpora

- inducing from monolingual corpora
  - Haghighi, A., Liang, P., Berg-Kirkpatrick, T., & Klein, D. (2008,
    June). Learning Bilingual Lexicons from Monolingual Corpora. In
    ACL (Vol. 2008, pp. 771-779).
  - Koehn, P., & Knight, K. (2002, July). Learning a translation
    lexicon from monolingual corpora. In Proceedings of the ACL-02
    workshop on Unsupervised lexical acquisition-Volume 9
    (pp. 9-16). Association for Computational Linguistics.
  - ...

- currently apertium-eng-kaz.eng-kaz.dix has roughly
  #+name: eng-kaz-entries
  #+begin_src sh :exports both
  grep -c "<e>" ../apertium-all/apertium-trunk/apertium-eng-kaz/apertium-eng-kaz.eng-kaz.dix
  #+end_src

  #+RESULTS: eng-kaz-entries
  : 32886

  entries in it.

- also see: [[http://wiki.apertium.org/wiki/Bilingual_dictionary_discovery]]

